import Core.Ty
import Core.Term
import Core.Global
import Core.Vec

-- import Core.Eval.BigStep
import Core.Infer.Type
import Core.Infer.Global
import Lilac
open Lilac


namespace Core.Examples

def CastCtx : List Global := [
  -- appc : (A ~ B) -> C ~ D -> (A • C ~ B • D)
  .defn "appc" (∀[★ -:> ★]∀[★ -:> ★]∀[★]∀[★] (t#3 ~[★ -:> ★]~ t#2) -:> (t#1 ~[★]~ t#0) -:> ((t#3 • t#1) ~[★]~ (t#2 • t#0)))
               (Λ[★ -:> ★]Λ[★ -:> ★]Λ[★]Λ[★] λ[t#3 ~[★ -:> ★]~ t#2] λ[t#1 ~[★]~ t#0]
                    (.cast ((t#4 • t#2) ~[★]~ (t#0 • t#1)) #1                           -- A • C ~ B • D
                      (.cast ((t#4 • t#2) ~[★]~ (t#4 • t#0)) #0 (refl! (t#3 • t#1))))), -- A • C ~ A • D
                                                                                    -- A • C ~ A • C

  -- arrowc : A ~ B -> C ~ D -> (A -:> C ~ B -:> D)
  .defn "arrowc" (∀[★]∀[★]∀[★]∀[★] (t#3 ~[★]~ t#2) -:> ((t#1 ~[★]~ t#0) -:> ((t#3 -:> t#1) ~[★]~ (t#2 -:> t#0))))
                 (Λ[★]Λ[★]Λ[★]Λ[★] λ[t#3 ~[★]~ t#2] λ[t#1 ~[★]~ t#0]
                    (.cast ((t#4 -:> t#2) ~[★]~ (t#0 -:> t#1)) #1                             -- A -:> C ~ B -:> D
                      (.cast ((t#4 -:> t#2) ~[★]~ (t#4 -:> t#0)) #0 (refl! (t#3 -:> t#1))))), -- A -:> C ~ A -:> D
                                                                                              -- A -:> C ~ A -:> C
  -- seq : A ~ B -> B ~ C -> A ~ C
  .defn "seq" (∀[★] ∀[★] ∀[★] (t#2 ~[★]~ t#1) -:> ((t#1 ~[★]~ t#0) -:> (t#2 ~[★]~ t#0)))
                  (Λ[★]Λ[★]Λ[★] λ[t#2 ~[★]~ t#1] λ[t#1 ~[★]~ t#0] .cast (t#3 ~[★]~ t#0) #0 #1),

  -- sym : B ~ A -> A ~ B
  .defn "sym" (∀[★] ∀[★] (t#1 ~[★]~ t#0) -:> (t#0 ~[★]~ t#1)) (Λ[★]Λ[★] λ[t#1 ~[★]~ t#0] (.cast (t#0 ~[★]~ t#2) #0 (refl! t#1)))
  ]



#guard (((Λ[★]Λ[★] λ[t#1 ~[★]~ t#0] (.cast (t#0 ~[★]~ t#2) #0 (refl! t#1)))).infer_type [] [] []) == some ((∀[★] ∀[★] (t#1 ~[★]~ t#0) -:> (t#0 ~[★]~ t#1)))


#guard (Λ[★]Λ[★]Λ[★] λ[t#2 ~[★]~ t#1] λ[t#1 ~[★]~ t#0] .cast (t#3 ~[★]~ t#0) #0 #1).infer_type [] [] [] == some (∀[★] ∀[★] ∀[★] (t#2 ~[★]~ t#1) -:> ((t#1 ~[★]~ t#0) -:> (t#2 ~[★]~ t#0)))

#guard (Λ[★]Λ[★]Λ[★]Λ[★] λ[t#3 ~[★]~ t#2] λ[t#1 ~[★]~ t#0]
                    (.cast ((t#4 -:> t#2) ~[★]~ (t#0 -:> t#1)) #1
                      (.cast ((t#4 -:> t#2) ~[★]~ (t#4 -:> t#0)) #0 (refl! (t#3 -:> t#1))))).infer_type [] [] []
                == some (∀[★]∀[★]∀[★]∀[★] (t#3 ~[★]~ t#2) -:> ((t#1 ~[★]~ t#0) -:> ((t#3 -:> t#1) ~[★]~ (t#2 -:> t#0))))

#guard (Λ[★ -:> ★]Λ[★ -:> ★]Λ[★]Λ[★] λ[t#3 ~[★ -:> ★]~ t#2] λ[t#1 ~[★]~ t#0]
                    (.cast ((t#4 • t#2) ~[★]~ (t#0 • t#1)) #1                           -- A • C ~ B • D
                      (.cast ((t#4 • t#2) ~[★]~ (t#4 • t#0)) #0 (refl! (t#3 • t#1))))).infer_type [] [] []
           == some (∀[★ -:> ★]∀[★ -:> ★]∀[★]∀[★] (t#3 ~[★ -:> ★]~ t#2) -:> (t#1 ~[★]~ t#0) -:> ((t#3 • t#1) ~[★]~ (t#2 • t#0)))

end Core.Examples
